import styles from './MyPage.module.scss';

import React from 'react';
import MyNav from 'src/components/MyNav';

const MyPage = () => {
    return (
        <main>
            <MyNav />

            <section className={ styles.myInfoSection }>
                <h1>마이 페이지 &gt; 회원 정보</h1>
                <h2>Alert Modal Test</h2>
                    언젠가 하겠지
                <br/>

                <h2>Confirm Modal Test</h2>
                    이것도,,
                <br/>



                <h2>Font Test</h2>
                <p className="custom1">
                Segoe UI// 대한민국은 민주공화국이다.
                    최근 은행들이 예금 금리를 잇달아 인상하며 소비자 유치 경쟁이 치열해지고 있다. 주요 시중은행은 정기예금 상품의 금리를 최대 0.5%p 인상하며 고객의 관심을 끌고 있다.
                    전문가들은 "기준금리 인상 기조에 따라 예금 금리도 추가 상승 가능성이 있다"며 "고객들은 금리 변동 추이를 주의 깊게 살펴볼 필요가 있다"고 조언했다.
                </p><br/>

                <p className="custom2">
                Segoe UI Emoji// 대한민국은 민주공화국이다.
                    최근 은행들이 예금 금리를 잇달아 인상하며 소비자 유치 경쟁이 치열해지고 있다. 주요 시중은행은 정기예금 상품의 금리를 최대 0.5%p 인상하며 고객의 관심을 끌고 있다.
                    전문가들은 "기준금리 인상 기조에 따라 예금 금리도 추가 상승 가능성이 있다"며 "고객들은 금리 변동 추이를 주의 깊게 살펴볼 필요가 있다"고 조언했다.
                </p><br/>

                <p className="custom3">
                Segoe UI Symbol// 대한민국은 민주공화국이다.
                    최근 은행들이 예금 금리를 잇달아 인상하며 소비자 유치 경쟁이 치열해지고 있다. 주요 시중은행은 정기예금 상품의 금리를 최대 0.5%p 인상하며 고객의 관심을 끌고 있다.
                    전문가들은 "기준금리 인상 기조에 따라 예금 금리도 추가 상승 가능성이 있다"며 "고객들은 금리 변동 추이를 주의 깊게 살펴볼 필요가 있다"고 조언했다.
                </p><br/>

                <p className="custom4">
                Noto Sans KR// 대한민국은 민주공화국이다.
                    최근 은행들이 예금 금리를 잇달아 인상하며 소비자 유치 경쟁이 치열해지고 있다. 주요 시중은행은 정기예금 상품의 금리를 최대 0.5%p 인상하며 고객의 관심을 끌고 있다.
                    전문가들은 "기준금리 인상 기조에 따라 예금 금리도 추가 상승 가능성이 있다"며 "고객들은 금리 변동 추이를 주의 깊게 살펴볼 필요가 있다"고 조언했다.
                </p><br/>

                <p className="custom5">
                Pretendard// 대한민국은 민주공화국이다.
                    최근 은행들이 예금 금리를 잇달아 인상하며 소비자 유치 경쟁이 치열해지고 있다. 주요 시중은행은 정기예금 상품의 금리를 최대 0.5%p 인상하며 고객의 관심을 끌고 있다.
                    전문가들은 "기준금리 인상 기조에 따라 예금 금리도 추가 상승 가능성이 있다"며 "고객들은 금리 변동 추이를 주의 깊게 살펴볼 필요가 있다"고 조언했다.
                </p><br/>

                <p className="custom6">
                Pretendard Variable// 대한민국은 민주공화국이다.
                    최근 은행들이 예금 금리를 잇달아 인상하며 소비자 유치 경쟁이 치열해지고 있다. 주요 시중은행은 정기예금 상품의 금리를 최대 0.5%p 인상하며 고객의 관심을 끌고 있다.
                    전문가들은 "기준금리 인상 기조에 따라 예금 금리도 추가 상승 가능성이 있다"며 "고객들은 금리 변동 추이를 주의 깊게 살펴볼 필요가 있다"고 조언했다.
                </p><br/>

                <p className="custom7">
                Gowun Batang// 대한민국은 민주공화국이다.
                    최근 은행들이 예금 금리를 잇달아 인상하며 소비자 유치 경쟁이 치열해지고 있다. 주요 시중은행은 정기예금 상품의 금리를 최대 0.5%p 인상하며 고객의 관심을 끌고 있다.
                    전문가들은 "기준금리 인상 기조에 따라 예금 금리도 추가 상승 가능성이 있다"며 "고객들은 금리 변동 추이를 주의 깊게 살펴볼 필요가 있다"고 조언했다.
                </p><br/>
            </section>
        
        
        </main>
    );
};

export default MyPage;